[
    {
        "id": 1,
        "title": "The Future of AI: Generative Models Take Center Stage",
        "excerpt": "Generative AI is reshaping industries from creative arts to software development, promising a new era of productivity.",
        "content": "<p>Artificial Intelligence has taken a massive leap forward with the advent of generative models. From DALL-E creating art to GPT-4 writing code, the landscape of technology is shifting beneath our feet.</p><h2>The Impact on Creativity</h2><p>Artists and writers are finding new collaborators in machines. While some fear displacement, others see an unprecedented opportunity for augmentation.</p><h2>Coding with AI</h2><p>Developers are now pair-programming with AI assistants, reducing boilerplate code and focusing on complex logic. The efficiency gains are palpable across the industry.</p>",
        "author": "Sarah Connor",
        "date": "Dec 19, 2025",
        "image": "https://images.unsplash.com/photo-1677442136019-21780ecad995?auto=format&fit=crop&q=80&w=1000",
        "category": "AI"
    },
    {
        "id": 2,
        "title": "Startup 'GreenTech' Raises $50M Series A",
        "excerpt": "A new player in the sustainable energy sector has secured significant funding to scale its carbon capture technology.",
        "content": "<p>GreenTech, a San Francisco-based startup, announced today that it has raised $50 million in Series A funding led by Sequoia Capital.</p><p>The company's proprietary carbon capture technology promises to reduce industrial emissions by up to 40% at a fraction of the current cost.</p><p>'We are thrilled to have the support of such visionary investors,' said CEO Jane Doe. 'This capital will allow us to build our first commercial-scale plant.'</p>",
        "author": "Mike Ross",
        "date": "Dec 18, 2025",
        "image": "https://images.unsplash.com/photo-1497366216548-37526070297c?auto=format&fit=crop&q=80&w=1000",
        "category": "Startups"
    },
    {
        "id": 3,
        "title": "Review: The New Pixel 10 Pro",
        "excerpt": "Google's latest flagship phone offers an incredible camera and all-day battery life, but is it worth the upgrade?",
        "content": "<p>The Pixel 10 Pro is here, and it's a beast. With the new Tensor G5 chip, performance is smoother than ever.</p><h2>Camera</h2><p>As expected, the camera is the star of the show. Night Sight is faster, and the new zoom capabilities are mind-blowing.</p><h2>Battery Life</h2><p>We easily got through a full day of heavy use. Google has finally cracked the code on battery optimization.</p>",
        "author": "David Smith",
        "date": "Dec 17, 2025",
        "image": "https://images.unsplash.com/photo-1598327775666-35cf88aea00c?auto=format&fit=crop&q=80&w=1000",
        "category": "Gadgets"
    },
    {
        "id": 4,
        "title": "Crypto Markets Rally as Regulations Clarify",
        "excerpt": "Bitcoin and Ethereum see double-digit gains following new SEC guidelines on digital assets.",
        "content": "<p>The cryptocurrency market breathed a sigh of relief this week as the SEC released clear guidelines for digital asset classification.</p><p>Bitcoin surged past $80,000, dragging the rest of the market with it. Institutional investors are reportedly preparing to enter the space in force.</p>",
        "author": "Alice Wonderland",
        "date": "Dec 16, 2025",
        "image": "https://images.unsplash.com/photo-1518546305927-5a555bb7020d?auto=format&fit=crop&q=80&w=1000",
        "category": "Fintech"
    },
    {
        "id": 5,
        "title": "SpaceX Successfully Launches Starship V3",
        "excerpt": "The massive rocket achieved orbit and returned safely, marking a major milestone for Mars colonization plans.",
        "content": "<p>SpaceX has done it again. Starship V3 lifted off from Starbase, Texas this morning, carrying a payload of Starlink satellites.</p><p>The booster caught itself on the tower arms, a feat that still looks like CGI no matter how many times we see it.</p>",
        "author": "Elon M.",
        "date": "Dec 15, 2025",
        "image": "https://images.unsplash.com/photo-1516849841032-87cbac4d88f7?auto=format&fit=crop&q=80&w=1000",
        "category": "Space"
    },
    {
        "id": 6,
        "title": "New CSS Features You Should Know in 2026",
        "excerpt": "From state queries to masonry layout, here's what's coming to the web platform.",
        "content": "<p>CSS continues to evolve at a rapid pace. The latest spec includes native masonry layout support, making Pinterest-style grids a breeze without JavaScript.</p><p>State queries are another game-changer, allowing components to style themselves based on their own internal state.</p>",
        "author": "Web Dev",
        "date": "Dec 14, 2025",
        "image": "https://images.unsplash.com/photo-1507721999472-8ed4421c4af2?auto=format&fit=crop&q=80&w=1000",
        "category": "Apps"
    }
]